shizhe430/H7serial/ESP32C6/Smart_Water_Gate_C6/sdkconfig.defaults
# Target chip
CONFIG_IDF_TARGET="esp32c6"

# Enable BLE for RainMaker provisioning (内部使用)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# RainMaker: Use Self Claiming (no BLE needed for cloud registration)
CONFIG_ESP_RMAKER_SELF_CLAIM=y


# Custom partition: 2MB factory
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Flash size: 4MB
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Local ASP.NET service used by this migrated project
CONFIG_WATER_WEB_SERVER_URL="http://192.168.86.151:5000"
CONFIG_WATER_WEB_SERVER_HOST="192.168.86.151"
CONFIG_WATER_WEB_SERVER_PORT=5000
